app/controllers/articles_controller.rb

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "my title updated"], ["body", "my body updated"], ["updated_at", "2019-02-04 20:46:30.561186"], ["id", 1]]